Revit 2027 API
FieldDomainPointsByXYZ Constructor
 Creates object from an array of three-dimensional point coordinates
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FieldDomainPointsByXYZ(
	IList<XYZ> points
)
Public Sub New (
	points As IList(Of XYZ)
)
public:
FieldDomainPointsByXYZ(
	IList<XYZ^>^ points
)
new :
        points : IList<XYZ> -> FieldDomainPointsByXYZ
Parameters
points IList<XYZ>
 Array of three-dimensional point coordinates representing domain points
Exceptions
Exception | Condition
ArgumentException |  Thrown when supplied array points contain too many members (over 1000)
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FieldDomainPointsByXYZ Class
Autodesk.Revit.DB.Analysis Namespace